{
    "greeting": "Bienvenido a mi portafolio",
    "developer": "Desarrollador",
    "home": "Inicio",
    "about": "Sobre mí",
    "about_me": [
        "¡Hola! Mi nombre es Alan Rangel, Soy un desarrollador frontend apasionado por construir experiencias web interactivas, dinámicas y con un diseño moderno. Me gusta combinar lógica con creatividad para transformar ideas en interfaces funcionales.",
        "Trabajo principalmente con tecnologías como React, Tailwind CSS y herramientas modernas del ecosistema frontend como framer-motion, React Router y Swiper. También tengo experiencia consumiendo APIs externas y organizando proyectos de forma escalable y reutilizable.",
        "Disfruto crear componentes accesibles, responsive y optimizados tanto para escritorio como para móvil. Me enfoco en que cada vista tenga una navegación fluida y una estructura clara, mejorando la experiencia del usuario.",
        "Siempre estoy en constante aprendizaje, buscando mejorar mi código, adaptarme a nuevas herramientas y compartir lo que voy construyendo. Me motiva mucho trabajar en proyectos que mezclan tecnología, diseño y buena organización."
    ],
    "projects_title": "Proyectos",
    "more_info": "Más información",
    "view": "Ver",
    "projects": {
        "poke": {
            "description": "App web para explorar y buscar Pokémon usando PokéAPI.",
            "moreInfo": "Esta aplicación muestra una lista de Pokémon obtenida desde la PokéAPI. Puedes buscar, filtrar y ver estadísticas detalladas de cada uno. Fue construida con React, Tailwind y React Router.",
            "slides": {
                "0": [
                    "Esta aplicación web muestra una vista completa de todas las regiones del universo Pokémon a través de una interfaz clara, visual y accesible.",
                    "Cada tarjeta representa una región distinta, con su imagen icónica y una descripción breve que introduce sus características principales.",
                    "Al hacer clic en cualquier tarjeta, se abre un modal que ofrece más información sobre esa región.",
                    "El diseño es completamente responsivo, pensado para funcionar perfectamente en computadoras y dispositivos móviles.",
                    "Ideal para fans que quieren explorar, aprender o simplemente revivir la nostalgia de cada generación."
                ],
                "1": [
                    "Este componente permite al usuario buscar cualquier Pokémon por su nombre desde cualquier página del sitio.",
                    "Al realizar la búsqueda, se despliega un modal que muestra información relevante del Pokémon encontrado, incluyendo su nombre, tipo y número de Pokédex (ID).",
                    "El modal está dividido en tres pestañas para organizar mejor la información:",
                    "Información: Se muestra la imagen del Pokémon junto a su versión shiny, una breve descripción, su habilidad principal y habilidad oculta. Estas habilidades están presentadas dentro de un sistema de acordeón.",
                    "Estadísticas: Las estadísticas base del Pokémon se presentan de forma visual, diferenciadas por colores para facilitar su lectura. Cada estadística tiene su propio acordeón para detalles adicionales.",
                    "Movimientos: Contiene una lista de movimientos organizados en acordeones. Incluye un botón para cargar más movimientos.",
                    "Este buscador mejora la experiencia del usuario al ofrecer acceso rápido y detallado a la información de cualquier Pokémon sin necesidad de cambiar de página."
                ],
                "2": [
                    "El modal despliega información adicional sobre cada región, incluyendo detalles como el profesor encargado, los Pokémon iniciales, los villanos principales y los Pokémon legendarios asociados.",
                    "También incorpora un botón para cerrarlo y un botón de 'Ver más', que permite acceder a una página con información extendida.",
                    "Esta funcionalidad mejora la experiencia del usuario al presentar contenido de manera organizada y accesible sin salir de la página principal."
                ],
                "3": [
                    "Esta página se activa al hacer clic en 'Ver más' dentro del modal de una región.",
                    "Su objetivo es proporcionar un acceso más profundo a los elementos clave de cada región a través de un diseño basado en tarjetas.",
                    "Lista Pokémon: Muestra la cantidad de Pokémon de la región. Los datos se obtienen dinámicamente desde la API. Al hacer clic, se accede a la lista completa.",
                    "Líderes de Gimnasio: Ofrece acceso a los líderes, su especialidad y su gimnasio. Se navega usando React Router (useNavigate).",
                    "La vista usa un componente reutilizable (Card) para mantener consistencia visual. Esta sección mejora la exploración de contenido en el sitio."
                ],
                "4": [
                    "Se activa al seleccionar 'Ver todos' desde la vista de detalle de una región.",
                    "Su propósito es mostrar todos los Pokémon de la región de forma visual, ordenada y dinámica.",
                    "Cada Pokémon se representa en una tarjeta con: ID, imagen, nombre, tipos, habilidad principal y botón para ver más.",
                    "Las tarjetas cambian de color automáticamente según el tipo del Pokémon.",
                    "Se incluye un filtro por tipo conectado a la API, y la lista está ordenada por número de Pokédex.",
                    "También se manejan estados de carga y errores, y se puede acceder a una vista con detalles ampliados.",
                    "Tecnologías: React (con hooks), React Router, Fetch API, TailwindCSS y componentes modulares."
                ],
                "5": [
                    "Esta página aparece al hacer clic en 'Ver más' desde cualquier tarjeta de Pokémon.",
                    "Reutiliza el diseño visual del modal, pero en página completa para una experiencia más rica.",
                    "Pestaña de Información: imagen oficial, versión shiny, descripción, habilidades (con acordeón), y evolución visual.",
                    "Pestaña de Estadísticas: muestra las estadísticas base en bloques de colores diferenciados.",
                    "Pestaña de Movimientos: lista de movimientos con acordeón y botón para cargar más.",
                    "Pestaña adicional de Mega Evoluciones: aparece si el Pokémon tiene formas mega. Cada forma incluye diseño, habilidades y estadísticas.",
                    "Hooks personalizados como usePokemonDetails y usePokemonAbilities manejan lógica de carga y errores.",
                    "La página es completamente responsiva y tiene navegación integrada para regresar a la lista anterior."
                ],
                "6": [
                    "Desde la lista de líderes de la región, el usuario puede acceder a una página dedicada a ellos.",
                    "Cada líder se presenta en una tarjeta informativa con imagen, nombre, ciudad, tipo de gimnasio y medalla.",
                    "También se muestra el equipo Pokémon con imagen, nombre y nivel.",
                    "Recompensas al vencerlos: MT y cantidad de pokedólares.",
                    "Los datos se cargan dinámicamente usando useGymLeaders y se filtran según la región.",
                    "Diseño en tarjetas responsivas con layout adaptable y jerarquía visual clara.",
                    "Se usan iconos para mejorar la visualización, y hay control de errores con imágenes de fallback.",
                    "Cada tarjeta hereda estilos según el tipo del líder (fuego, agua, etc.), aplicados en cabecera y decoraciones."
                ]
            }

        },
        "portfolio": {
            "description": "Portafolio personal creado con React y Tailwind CSS.",
            "moreInfo": "Este portafolio muestra mis proyectos y habilidades. Fue construido con React, Tailwind CSS y Framer Motion para animaciones.",
            "slides": {
                "0": [
                    "Este portafolio está diseñado para mostrar mis habilidades y proyectos. Cada sección está organizada para facilitar la navegación y la comprensión de mi trabajo. El diseño es responsivo, adaptándose a diferentes dispositivos y tamaños de pantalla. Utiliza animaciones sutiles para mejorar la experiencia del usuario.",
                    "El portafolio incluye animaciones suaves utilizando Framer Motion. Las transiciones entre secciones son fluidas, mejorando la experiencia general del usuario. Los elementos interactivos están diseñados para ser intuitivos y atractivos.",
                    "Cada proyecto se presenta con una breve descripción y un enlace para ver más detalles. La sección de proyectos está organizada para facilitar la navegación, permitiendo a los usuarios explorar mi trabajo sin esfuerzo."
                ],
                "1": [
                    "Esta barra de navegación permanece fija en la parte superior de la pantalla, ofreciendo acceso rápido a todas las secciones principales del sitio: Inicio, Acerca de mí, Proyectos y Contacto. Utiliza un desplazamiento suave para una experiencia de usuario fluida e incluye un logotipo que enlaza con la sección de inicio. Desarrollada con React, Tailwind CSS y React Scroll.",
                    "La barra de navegación está fijada en la parte superior de la página, lo que garantiza un acceso constante a las secciones principales al desplazarse. Incluye un logotipo del sitio a la izquierda, que regresa suavemente a la sección de inicio al hacer clic. Cada elemento del menú se desplaza suavemente a su sección correspondiente mediante React Scroll, lo que mejora la navegación. Los elementos del menú están diseñados para mayor claridad y resaltan las secciones activas.",
                    "En la vista de escritorio, todos los enlaces de navegación se muestran en horizontal. En pantallas más pequeñas (móviles), la barra de navegación se transforma en un menú de hamburguesa para una interfaz de usuario limpia. Al hacer clic en el icono de hamburguesa, se abre un menú superpuesto a pantalla completa con enlaces apilados verticalmente. Este diseño adaptable garantiza la usabilidad en todos los dispositivos.",
                    "La barra de navegación cuenta con un interruptor de modo oscuro que permite a los usuarios cambiar entre temas claros y oscuros. El modo oscuro se aplica globalmente a través de la versión oscura de Tailwind, ajustando fondos, texto y bordes. Esto mejora la accesibilidad y la comodidad del usuario en diferentes condiciones de iluminación.",
                    "Se integra un selector de idioma que permite a los usuarios cambiar entre varios idiomas. Todo el texto de la barra de navegación se localiza con react-i18next, lo que garantiza una experiencia personalizada. La preferencia de idioma se mantiene mientras los usuarios navegan por el sitio."
                ],
                "2": [
                    "La sección Inicio sirve como la zona de aterrizaje del portafolio. Presenta al usuario con un titular profesional, una breve descripción y un botón de llamada a la acción prominente que lleva fácilmente a la sección Proyectos. Esta sección es totalmente responsiva y adapta su diseño y tipografía para una legibilidad óptima en todos los dispositivos.",     
                    "Esta sección da la bienvenida al visitante con un saludo amable y el nombre y la profesión del propietario del portafolio. Suele contener texto animado o tipografía con estilo para captar la atención desde el primer momento. La profesión se indica claramente (por ejemplo, 'Desarrollador Frontend'), lo que proporciona un contexto inmediato sobre la experiencia del usuario.",
                    "Se incluye un botón de llamada a la acción (CTA) para guiar a los usuarios a explorar el trabajo/proyectos. Este botón se desplaza suavemente para acceder a la sección Proyectos. Su diseño destaca por su efecto de desplazamiento y colores contrastantes.",
                    "El diseño está centrado vertical y horizontalmente en la mayoría de las pantallas, lo que proporciona una primera impresión equilibrada y elegante. La tipografía se adapta fluidamente al tamaño de la pantalla, manteniendo la jerarquía visual y la legibilidad. El espaciado y el tamaño adaptables garantizan una excelente apariencia en dispositivos móviles, tabletas y computadoras de escritorio.",
                    "La internacionalización es compatible con react-i18next, que traduce dinámicamente el texto de saludos, profesiones y botones. El texto se actualiza automáticamente según el idioma seleccionado en la barra de navegación. Esto proporciona una experiencia acogedora y accesible para usuarios de todo el mundo."               
                ],
                "3": [
                    "La sección 'Sobre mí' ofrece a los visitantes información sobre la trayectoria del desarrollador, su enfoque técnico y su personalidad profesional. Está escrita en un tono conciso pero atractivo y admite contenido multilingüe a través de react-i18next. El diseño se adapta de forma responsiva, y se pueden usar iconos o imágenes para realzar el interés visual.",
                    "Esta sección incluye una introducción sencilla que describe la trayectoria del desarrollador y su pasión por la programación o el diseño. Suele mencionar las tecnologías clave utilizadas (p. ej., React, JavaScript, TailwindCSS) y sus áreas de interés (p. ej., UI/UX, desarrollo frontend). El tono es personal y accesible, con el objetivo de conectar con el visitante.",
                    "El texto se presenta en párrafos cortos o viñetas para facilitar la lectura. La tipografía responsiva garantiza la legibilidad en todos los dispositivos, desde móviles hasta ordenadores de escritorio. Se pueden usar animaciones (p. ej., fundidos de entrada) o transiciones para atraer sutilmente la atención a la sección.",
                    "Esta sección puede incluir un avatar o una imagen personal, aportando un toque personal. Se presenta opcionalmente una lista de habilidades blandas y duras, ya sea en formato de texto o como insignias o iconos. Algunos portafolios incluyen resúmenes de experiencia o formación en esta área.",
                    "Todo el texto se traduce dinámicamente con react-i18next, lo que permite a los usuarios leerlo en su idioma preferido. El contenido está estructurado para mantener la coherencia de significado y tono en todos los idiomas, manteniendo la claridad y el profesionalismo."
                ],
                "4": [
                    "La sección Proyectos presenta una lista seleccionada de trabajos desarrollados por el autor. Cada proyecto se muestra como una tarjeta con título, una breve descripción e imagen. Al hacer clic en un proyecto, se abre un modal detallado que incluye un deslizador basado en Swiper con texto e imágenes sincronizados, lo que permite una exploración paso a paso. El contenido es compatible con varios idiomas a través de react-i18next, y la interfaz de usuario es responsiva y está diseñada con TailwindCSS.",
                    "Esta sección muestra todos los proyectos destacados como tarjetas individuales dentro de un diseño de cuadrícula responsivo. Cada tarjeta contiene una imagen del proyecto, un título y una breve introducción o un resumen de la pila tecnológica. Las tarjetas utilizan efectos de desplazamiento y transiciones para invitar a la interacción.",
                    "Al hacer clic en un proyecto, se abre un modal con animaciones Framer Motion para una entrada y salida fluidas. Dentro del modal, un deslizador Swiper muestra los detalles del proyecto. Swiper incluye diapositivas sincronizadas con texto e imágenes, que ofrecen una guía narrativa del proyecto.",
                    "Cada diapositiva puede presentar una característica, un reto o un aspecto de diseño del proyecto, acompañado de una imagen relevante. Las viñetas se muestran debajo de la imagen para facilitar la navegación, y el diseño garantiza que permanezcan visibles incluso en pantallas pequeñas. Este formato inmersivo ayuda a explicar proyectos complejos de forma más clara y visual.",
                    "Los botones de navegación (anterior/siguiente) están habilitados y diseñados para adaptarse al tema del modal. Los modales son responsivos y se ajustan perfectamente a diferentes tamaños y orientaciones de pantalla. El modo oscuro es totalmente compatible y adapta el estilo tanto de la tarjeta como del modal.",
                    "Todo el contenido del proyecto es multilingüe con react-i18next, incluyendo el texto del modal y las diapositivas. Esto garantiza que los usuarios puedan leer sobre los proyectos en su idioma preferido sin comprometer la maquetación ni el diseño."
                ],
                "5": [
                    "La sección de Contacto ofrece a los visitantes una forma sencilla de contactar con el desarrollador. Incluye un formulario de contacto adaptable con campos para nombre, correo electrónico y mensaje, además de validación y comentarios claros. También se presentan iconos o enlaces a perfiles sociales (GitHub, LinkedIn, etc.). Todo el contenido está internacionalizado con react-i18next y el diseño se adapta bien a los modos claro/oscuro.",
                    "Esta sección presenta un diseño centrado con un encabezado claro y una breve introducción que anima a los usuarios a ponerse en contacto. El mensaje es amigable y profesional, invitando a la colaboración o a hacer preguntas sobre el portafolio o los proyectos. Utiliza un desplazamiento suave desde la barra de navegación para un acceso directo.",
                    "El formulario de contacto incluye campos para nombre, correo electrónico y mensaje, todos diseñados con TailwindCSS. Cada campo incluye texto de marcador de posición y un borde con información al enfocar para una mejor experiencia de usuario. La validación del formulario garantiza que ningún campo quede vacío y que el correo electrónico tenga un formato válido antes del envío.",
                    "Al enviar el mensaje, los usuarios reciben una confirmación (por ejemplo, un mensaje de notificación o una alerta) si el mensaje se envió correctamente. Como alternativa, si se produce un error, se muestra un mensaje de error intuitivo. Se puede utilizar una integración opcional con el backend (como EmailJS o Formspree) para la entrega de mensajes reales.",
                    "Debajo o al lado del formulario, los iconos enlazan a perfiles externos como GitHub, LinkedIn o correo electrónico. Estos iconos están diseñados con efectos de desplazamiento y alineados de forma uniforme para un diseño limpio. Los iconos mejoran la legibilidad y ofrecen a los usuarios nuevas formas de conectarse.",
                    "Todo el texto, las etiquetas y los marcadores de posición se localizan con react-i18next para ser compatibles con varios idiomas. La capacidad de respuesta garantiza que el formulario y los iconos se vean bien tanto en dispositivos móviles como de escritorio. La compatibilidad con el modo oscuro garantiza que las entradas y los iconos sean legibles en cualquier tema."
                ]
            }
        }
    },
    "see_projects": "Ver Proyectos",
    "contact": "Contacto"
}